---
kind: type
id: T:Autodesk.Revit.DB.Architecture.Railing
zh: 栏杆
source: html/4af1265f-859e-123b-ada5-a479324f3dee.htm
---
# Autodesk.Revit.DB.Architecture.Railing

**中文**: 栏杆

Represents a railing element in Autodesk Revit.

## Syntax (C#)
```csharp
public class Railing : Element
```